vanvught/GD32F407RE-DMX512-RDM/lib-network/src/apps/ntp/gd32/ptp/ntpclient.cpp
static void Send();

static void PtpNtpTimer([[maybe_unused]] TimerHandle_t handle) {
    assert(s_ntp_client.status != ntp::Status::kStopped);
    assert(s_ntp_client.status != ntp::Status::kDisabled);

    if (s_ntp_client.status == ntp::Status::kWaiting) {
        if (s_ntp_client.request_timeout_seconds > 1) {
            s_ntp_client.request_timeout_seconds--;
            return;
        }

        if (s_ntp_client.request_timeout_seconds == 1) {
            s_ntp_client.status = ntp::Status::kFailed;
            network::apps::ntpclient::DisplayStatus(ntp::Status::kFailed);
            s_ntp_client.poll_seconds = network::apps::ntpclient::kPollSecondsMin;
            return;
        }
        return;
    }

    if (s_ntp_client.poll_seconds > 1) {
        s_ntp_client.poll_seconds--;
        return;
    }

    if (s_ntp_client.poll_seconds == 1) {
        Send();
    }
}

// The interleaved client/server mode is similar to the basic client/ server mode.
// The difference between the two modes is in the values saved to the origin and transmit timestamp fields.
static void Send() {
    s_ntp_client.state.missed_responses++;
    // The first request from a client is always in the basic mode and so is the server response.
    // It has a zero origin timestamp and zero receive timestamp.
    // Only when the client receives a valid response from the server,
    // it will be able to send a request in the interleaved mode
    if (s_ntp_client.state.missed_responses > 4) {
        s_ntp_client.cookie_basic.seconds = static_cast<uint32_t>(random());
        s_ntp_client.cookie_basic.fraction = 0;

        s_ntp_client.request.origin_timestamp_s = 0;
        s_ntp_client.request.origin_timestamp_f = 0;

        s_ntp_client.request.receive_timestamp_s = 0;
        s_ntp_client.request.receive_timestamp_f = 0;
        // The origin timestamp is a cookie which is used to detect that a received packet
        // is a response to the last packet sent in the other direction of the association.
        s_ntp_client.request.transmit_timestamp_s = __builtin_bswap32(s_ntp_client.cookie_basic.seconds);
        s_ntp_client.request.transmit_timestamp_f = __builtin_bswap32(s_ntp_client.cookie_basic.fraction);
    } else {
        // A client request in the interleaved mode has an origin timestamp equal to
        // the receive timestamp from the last valid server response.
        s_ntp_client.request.origin_timestamp_s = __builtin_bswap32(s_ntp_client.state.dst.seconds);
        s_ntp_client.request.origin_timestamp_f = __builtin_bswap32(s_ntp_client.state.dst.fraction);

        s_ntp_client.request.receive_timestamp_s = __builtin_bswap32(s_ntp_client.state.previous_receive.seconds);
        s_ntp_client.request.receive_timestamp_f = __builtin_bswap32(s_ntp_client.state.previous_receive.fraction);

        if (s_ntp_client.state.x > 0) {
            s_ntp_client.request.transmit_timestamp_s = __builtin_bswap32(s_ntp_client.state.sent_b.seconds);
            s_ntp_client.request.transmit_timestamp_f = __builtin_bswap32(s_ntp_client.state.sent_b.fraction);
        } else {
            s_ntp_client.request.transmit_timestamp_s = __builtin_bswap32(s_ntp_client.state.sent_a.seconds);
            s_ntp_client.request.transmit_timestamp_f = __builtin_bswap32(s_ntp_client.state.sent_a.fraction);
        }
    }

    network::udp::SendWithTimestamp(s_ntp_client.handle, reinterpret_cast<const uint8_t*>(&s_ntp_client.request), kRequestSize, s_ntp_client.server_ip, network::iana::Ports::kPortNtp);

#ifndef NDEBUG
    printf("Request:  org=%.8x%.8x rx=%.8x%.8x tx=%.8x%.8x\n",
           static_cast<unsigned>(__builtin_bswap32(s_ntp_client.request.origin_timestamp_s)),    // NOLINT
           static_cast<unsigned>(__builtin_bswap32(s_ntp_client.request.origin_timestamp_f)),    // NOLINT
           static_cast<unsigned>(__builtin_bswap32(s_ntp_client.request.receive_timestamp_s)),   // NOLINT
           static_cast<unsigned>(__builtin_bswap32(s_ntp_client.request.receive_timestamp_f)),   // NOLINT
           static_cast<unsigned>(__builtin_bswap32(s_ntp_client.request.transmit_timestamp_s)),  // NOLINT
           static_cast<unsigned>(__builtin_bswap32(s_ntp_client.request.transmit_timestamp_f))); // NOLINT
#endif

    if (s_ntp_client.state.x > 0) {
        s_ntp_client.state.sent_a.seconds = net::globals::ptp::timestamp[1] + ntp::kJan1970;
        s_ntp_client.state.sent_a.fraction = NTPFRAC(gd32::PtpSubsecond2Nanosecond(net::globals::ptp::timestamp[0]));
    } else {
        s_ntp_client.state.sent_b.seconds = net::globals::ptp::timestamp[1] + ntp::kJan1970;
        s_ntp_client.state.sent_b.fraction = NTPFRAC(gd32::PtpSubsecond2Nanosecond(net::globals::ptp::timestamp[0]));
    }

    s_ntp_client.state.x = -s_ntp_client.state.x;
    s_id++;

    s_ntp_client.request_timeout_seconds = network::apps::ntpclient::kTimeoutSeconds;
    s_ntp_client.status = ntp::Status::kWaiting;
    network::apps::ntpclient::DisplayStatus(ntp::Status::kWaiting);
}

static void Difference(const ntp::TimeStamp& start, const ntp::TimeStamp& stop, int32_t& diff_seconds, int32_t& diff_nano_seconds) {
    gd32::ptp::time_t r;
    const gd32::ptp::time_t kX = {.tv_sec = static_cast<int32_t>(stop.seconds), .tv_nsec = static_cast<int32_t>(USEC(stop.fraction) * 1000)};
    const gd32::ptp::time_t kY = {.tv_sec = static_cast<int32_t>(start.seconds), .tv_nsec = static_cast<int32_t>(USEC(start.fraction) * 1000)};
    gd32::SubTime(&r, &kX, &kY);

    diff_seconds = r.tv_sec;
    diff_nano_seconds = r.tv_nsec;
}

static inline int32_t AbsInt32(int32_t x) {
    return (x < 0) ? -x : x;
}

static void UpdatePtpTime() {
    int32_t diff_seconds1;
    int32_t diff_nano_seconds1;
    Difference(s_ntp_client.t1, s_ntp_client.t2, diff_seconds1, diff_nano_seconds1);

    int32_t diff_seconds2;
    int32_t diff_nano_seconds2;
    Difference(s_ntp_client.t4, s_ntp_client.t3, diff_seconds2, diff_nano_seconds2);

    const auto kOffsetSeconds = static_cast<int64_t>(diff_seconds1) + static_cast<int64_t>(diff_seconds2);
    const auto kOffsetNanoSeconds = static_cast<int64_t>(diff_nano_seconds1) + static_cast<int64_t>(diff_nano_seconds2);

    const auto kOffsetSecondsAverage = static_cast<int32_t>(kOffsetSeconds / 2U);
    const auto kOffsetNanosverage = static_cast<int32_t>(kOffsetNanoSeconds / 2U);

