vanvught/GD32F407RE-DMX512-RDM/lib-network/src/apps/ntp/gd32/ptp/ntpclient.cpp
    gd32::ptp::time_t ptp_offset = {.tv_sec = kOffsetSecondsAverage, .tv_nsec = kOffsetNanosverage};
    gd32::NormalizeTime(&ptp_offset);
    Gd32PtpUpdateTime(&ptp_offset);

    gd32::ptp::ptptime ptp_get;
    Gd32PtpGetTime(&ptp_get);

    s_ntp_client.request.reference_timestamp_s = __builtin_bswap32(ptp_get.tv_sec + ntp::kJan1970);
    s_ntp_client.request.reference_timestamp_f = __builtin_bswap32(NTPFRAC(ptp_get.tv_nsec));

    if ((ptp_offset.tv_sec == 0) && (ptp_offset.tv_nsec > -999999) && (ptp_offset.tv_nsec < 999999)) {
        s_ntp_client.status = ntp::Status::kLocked;
        network::apps::ntpclient::DisplayStatus(ntp::Status::kLocked);
        if (++s_ntp_client.locked_count == 4) {
            s_ntp_client.poll_seconds = network::apps::ntpclient::kPollSecondsMax;
        }
    } else {
        s_ntp_client.status = ntp::Status::kIdle;
        network::apps::ntpclient::DisplayStatus(ntp::Status::kIdle);
        s_ntp_client.poll_seconds = network::apps::ntpclient::kPollSecondsMin;
        s_ntp_client.locked_count = 0;
    }

#ifndef NDEBUG
    /**
     * Network delay calculation
     */
    gd32::ptp::time_t diff1;
    gd32::ptp::time_t diff2;

    if (s_ntp_client.state.mode == ntp::Modes::kBasic) {
        Difference(s_ntp_client.t1, s_ntp_client.t4, diff1.tv_sec, diff1.tv_nsec);
        Difference(s_ntp_client.t2, s_ntp_client.t3, diff2.tv_sec, diff2.tv_nsec);
    } else {
        ntp::TimeStamp start;
        start.seconds = __builtin_bswap32(s_ntp_client.request.transmit_timestamp_s);
        start.fraction = __builtin_bswap32(s_ntp_client.request.transmit_timestamp_f);
        ntp::TimeStamp stop;
        stop.seconds = __builtin_bswap32(s_ntp_client.request.receive_timestamp_s);
        stop.fraction = __builtin_bswap32(s_ntp_client.request.receive_timestamp_f);
        Difference(start, stop, diff1.tv_sec, diff1.tv_nsec);

        const auto* const kReply = s_ntp_client.reply;
        start.seconds = __builtin_bswap32(s_ntp_client.request.origin_timestamp_s);
        start.fraction = __builtin_bswap32(s_ntp_client.request.origin_timestamp_f);
        stop.seconds = __builtin_bswap32(kReply->transmit_timestamp_s);
        stop.fraction = __builtin_bswap32(kReply->transmit_timestamp_f);
        Difference(start, stop, diff2.tv_sec, diff2.tv_nsec);
    }

    gd32::ptp::time_t ptp_delay;
    gd32::SubTime(&ptp_delay, &diff1, &diff2);

    char sign = '+';

    if (ptp_offset.tv_sec < 0) {
        ptp_offset.tv_sec = -ptp_offset.tv_sec;
        sign = '-';
    }

    if (ptp_offset.tv_nsec < 0) {
        ptp_offset.tv_nsec = -ptp_offset.tv_nsec;
        sign = '-';
    }

    printf(" %s : offset=%c%d.%09d delay=%d.%09d\n", 
      s_ntp_client.state.mode == ntp::Modes::kBasic ? "Basic" : "Interleaved", 
      sign, 
      static_cast<int>(ptp_offset.tv_sec), 
      static_cast<int>(ptp_offset.tv_nsec), 
      static_cast<int>(ptp_delay.tv_sec), 
      static_cast<int>(ptp_delay.tv_nsec));
#endif
}

/**
 * Two of the tests are modified for the interleaved mode:
 *
 * 1. The check for duplicate packets SHOULD compare both receive and
 *    transmit timestamps in order to not drop a valid response in the interleaved mode if
 *    it follows a response in the basic mode and they contain the same transmit timestamp.
 * 2. The check for bogus packets SHOULD compare the origin timestamp with both transmit and
 *    receive timestamps from the request.
 *    If the origin timestamp is equal to the transmit timestamp, the response is in the basic mode.
 *    If the origin timestamp is equal to the receive timestamp, the response is in the interleaved mode.
 */

static void Process() {
    const auto* const kReply = s_ntp_client.reply;
#ifndef NDEBUG
    printf("Response: org=%.8x%.8x rx=%.8x%.8x tx=%.8x%.8x\n",
           static_cast<unsigned>(__builtin_bswap32(kReply->origin_timestamp_s)),    // NOLINT
           static_cast<unsigned>(__builtin_bswap32(kReply->origin_timestamp_f)),    // NOLINT
           static_cast<unsigned>(__builtin_bswap32(kReply->receive_timestamp_s)),   // NOLINT
           static_cast<unsigned>(__builtin_bswap32(kReply->receive_timestamp_f)),   // NOLINT
           static_cast<unsigned>(__builtin_bswap32(kReply->transmit_timestamp_s)),  // NOLINT
           static_cast<unsigned>(__builtin_bswap32(kReply->transmit_timestamp_f))); // NOLINT
#endif
    // If the origin timestamp is equal to the transmit timestamp, the response is in the basic mode.
    if ((kReply->origin_timestamp_s == s_ntp_client.request.transmit_timestamp_s) && (kReply->origin_timestamp_f == s_ntp_client.request.transmit_timestamp_f)) {
        if (s_ntp_client.state.x < 0) {
            s_ntp_client.t1.seconds = s_ntp_client.state.sent_a.seconds;
            s_ntp_client.t1.fraction = s_ntp_client.state.sent_a.fraction;
        } else {
            s_ntp_client.t1.seconds = s_ntp_client.state.sent_b.seconds;
            s_ntp_client.t1.fraction = s_ntp_client.state.sent_b.fraction;
        }

        s_ntp_client.t4.seconds = net::globals::ptp::timestamp[1] + ntp::kJan1970;
        s_ntp_client.t4.fraction = NTPFRAC(gd32::PtpSubsecond2Nanosecond(net::globals::ptp::timestamp[0]));
#ifndef NDEBUG
        s_ntp_client.state.mode = ntp::Modes::kBasic;
#endif
    } else
        // If the origin timestamp is equal to the receive timestamp, the response is in the interleaved mode.
        if ((kReply->origin_timestamp_s == s_ntp_client.request.receive_timestamp_s) && (kReply->origin_timestamp_f == s_ntp_client.request.receive_timestamp_f)) {
            if (s_ntp_client.state.x > 0) {
                s_ntp_client.t1.seconds = s_ntp_client.state.sent_b.seconds;
                s_ntp_client.t1.fraction = s_ntp_client.state.sent_b.fraction;
            } else {
                s_ntp_client.t1.seconds = s_ntp_client.state.sent_a.seconds;
                s_ntp_client.t1.fraction = s_ntp_client.state.sent_a.fraction;
            }

            s_ntp_client.t4.seconds = s_ntp_client.state.previous_receive.seconds;
            s_ntp_client.t4.fraction = s_ntp_client.state.previous_receive.fraction;
#ifndef NDEBUG
            s_ntp_client.state.mode = ntp::Modes::kInterleaved;
#endif
        } else {
            DEBUG_PUTS("INVALID RESPONSE");
            return;
        }

