vanvught/GD32F407RE-DMX512-RDM/lib-network/src/apps/ntp/gd32/ptp/ntpclient.cpp
    s_ntp_client.t2.seconds = __builtin_bswap32(kReply->receive_timestamp_s);
    s_ntp_client.t2.fraction = __builtin_bswap32(kReply->receive_timestamp_f);

    s_ntp_client.t3.seconds = __builtin_bswap32(kReply->transmit_timestamp_s);
    s_ntp_client.t3.fraction = __builtin_bswap32(kReply->transmit_timestamp_f);

    s_ntp_client.state.dst.seconds = __builtin_bswap32(kReply->receive_timestamp_s);
    s_ntp_client.state.dst.fraction = __builtin_bswap32(kReply->receive_timestamp_f);

    s_ntp_client.state.previous_receive.seconds = net::globals::ptp::timestamp[1] + ntp::kJan1970;
    s_ntp_client.state.previous_receive.fraction = NTPFRAC(gd32::PtpSubsecond2Nanosecond(net::globals::ptp::timestamp[0]));

    UpdatePtpTime();

    s_ntp_client.state.missed_responses = 0;

    Print("T1: ", &s_ntp_client.t1);
    Print("T2: ", &s_ntp_client.t2);
    Print("T3: ", &s_ntp_client.t3);
    Print("T4: ", &s_ntp_client.t4);
}

namespace network::apps::ntpclient::ptp {
#pragma GCC pop_options
#pragma GCC push_options
#pragma GCC optimize("Os")

/**
 * @brief Initializes the Precision Time Protocol (PTP) NTP client.
 *
 * This function performs the initial setup for the NTP client, including
 * clearing its state, setting default values, and loading network parameters
 * such as the NTP server's IP address.
 *
 * The initialization includes:
 * - Resetting all state variables to their default values.
 * - Configuring the initial NTP request packet parameters.
 * - Setting the client status to `IDLE`.
 * - Initializing the random number generator using the current system time.
 * - Loading network parameters to retrieve the configured NTP server IP address.
 *
 * @note This function must be called before starting the NTP client.
 */
void Init() {
    DEBUG_ENTRY();

    memset(&s_ntp_client, 0, sizeof(struct NtpClient));

    s_ntp_client.state.previous_receive.seconds = ntp::kJan1970;
    s_ntp_client.state.dst.seconds = ntp::kJan1970;
    s_ntp_client.state.sent_a.seconds = ntp::kJan1970;
    s_ntp_client.state.sent_b.seconds = ntp::kJan1970;
    s_ntp_client.state.missed_responses = 4;

    s_ntp_client.request.li_vn_mode = ntp::kVersion | ntp::kModeClient;
    s_ntp_client.request.poll = network::apps::ntpclient::kPollPowerMin;
    s_ntp_client.request.reference_id = ('A' << 0) | ('V' << 8) | ('S' << 16);

    s_ntp_client.state.x = 1;
    s_ntp_client.status = ntp::Status::kIdle;

    struct timeval tv;
    gettimeofday(&tv, nullptr);
    srandom(static_cast<unsigned int>(tv.tv_sec ^ tv.tv_usec));

    s_ntp_client.server_ip = ConfigStore::Instance().NetworkGet(&common::store::Network::ntp_server_ip);

    DEBUG_EXIT();
}

/**
 * @brief Starts the NTP client.
 *
 * This function initializes the UDP socket for NTP communication, starts a software
 * timer for periodic tasks, and sends the first NTP request to the server.
 *
 * @note The function will not start the client if it is disabled or if the server
 *       IP address is not configured.
 */
void Start() {
    DEBUG_ENTRY();

    if (s_ntp_client.status == ntp::Status::kDisabled) {
        DEBUG_EXIT();
        return;
    }

    if (s_ntp_client.server_ip == 0) {
        s_ntp_client.status = ntp::Status::kStopped;
        network::apps::ntpclient::DisplayStatus(ntp::Status::kStopped);
        DEBUG_EXIT();
        return;
    }

    s_ntp_client.handle = network::udp::Begin(network::iana::Ports::kPortNtp, Input);
    assert(s_ntp_client.handle != -1);

    s_ntp_client.status = ntp::Status::kIdle;
    network::apps::ntpclient::DisplayStatus(ntp::Status::kIdle);

    s_ntp_client.timer_id = SoftwareTimerAdd(1000, PtpNtpTimer);

    Send();

    DEBUG_EXIT();
}

/**
 * @brief Stops the NTP client.
 *
 * This function stops the software timer and closes the UDP socket. It optionally
 * disables the client if the `doDisable` parameter is set to `true`.
 *
 * @param[in] doDisable Set to `true` to disable the client after stopping.
 */
void Stop(bool do_disable) {
    DEBUG_ENTRY();

    if (do_disable) {
        s_ntp_client.status = ntp::Status::kDisabled;
        network::apps::ntpclient::DisplayStatus(ntp::Status::kDisabled);
    }

    if (s_ntp_client.status == ntp::Status::kStopped) {
        return;
    }

    SoftwareTimerDelete(s_ntp_client.timer_id);

    network::udp::End(network::iana::Ports::kPortNtp);
    s_ntp_client.handle = -1;

    if (!do_disable) {
        s_ntp_client.status = ntp::Status::kStopped;
        network::apps::ntpclient::DisplayStatus(ntp::Status::kStopped);
    }

    DEBUG_EXIT();
}

/**
 * @brief Sets the IP address of the NTP server.
 *
 * This function updates the server IP address used by the NTP client.
 *
 * @param[in] server_ip The IP address of the NTP server.
 */
void SetServerIp(uint32_t server_ip) {
    Stop(false);

    s_ntp_client.server_ip = server_ip;

    Start();
}

/**
 * @brief Retrieves the IP address of the configured NTP server.
 *
 * @return The IP address of the NTP server.
 */
uint32_t GetServerIp() {
    return s_ntp_client.server_ip;
}

/**
 * @brief Retrieves the current status of the NTP client.
 *
 * This function returns the current operational status of the NTP client.
 *
 * @return The status of the NTP client as an `ntp::Status` enum.
 */
ntp::Status GetStatus() {
    return s_ntp_client.status;
}
} // namespace network::apps::ntpclient::ptp
#pragma GCC pop_options